FamilyBaseUtil.isRebarShapeDocument(ADocument!System.Runtime.CompilerServices.IsConst*)
Checks if the given document represents a rebar shape.
pADoc: document to check
Returns: true if the type is rebarshape, false otherwise.